vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN537_DFP.pdsc
    <condition id="driver.powerquad.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.psp27801.condition_id">
      <require condition="allOf.driver.common, device=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.puf_v3.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.pwm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.reset.condition_id">
      <require condition="allOf.device=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.romapi.condition_id">
      <require condition="allOf.driver.common, driver.mem_interface, driver.romapi_flashiap, driver.romapi_nboot, driver.runbootloader, device=MCXN537.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.mem_interface, driver.romapi_flashiap, driver.romapi_nboot, driver.runbootloader, device=MCXN537.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_flashiap"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_nboot"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="runbootloader"/>
      <require condition="device.MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.romapi_flashiap.condition_id">
      <require condition="allOf.driver.common, driver.romapi, device=MCXN537.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.romapi, device=MCXN537.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
      <require condition="device.MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.romapi_nboot.condition_id">
      <require condition="allOf.driver.common, driver.romapi, device=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.rtt.condition_id">
      <require condition="allOf.driver.rtt.template, device=MCXN537.internal_condition"/>
    </condition>
    <condition id="allOf.driver.rtt.template, device=MCXN537.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template"/>
      <require condition="device.MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.rtt.template.condition_id">
      <require condition="allOf.device=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.runbootloader.condition_id">
      <require condition="allOf.driver.common, driver.romapi, device=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.sai.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.sai_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.sai, driver.edma4, device=MCXN537.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.sai, driver.edma4, device=MCXN537.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.sctimer.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.sema42.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.sgtl5000.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MCXN537.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MCXN537.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_phy_gpio.condition_id">
      <require condition="allOf.driver.common, driver.smartcard_uart, device_id=MCXN537.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.smartcard_uart, device_id=MCXN537.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_uart"/>
      <require condition="device_id.MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_phy_tda8035.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_uart.condition_id">
      <require condition="allOf.driver.common, device=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.smartdma.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.smartdma_mcxn.condition_id">
      <require condition="allOf.anyOf=device_id=MCXN537, driver.smartdma.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXN537, driver.smartdma.internal_condition">
      <require condition="anyOf.device_id=MCXN537.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartdma"/>
    </condition>
    <condition id="driver.ssd1963.condition_id">
      <require condition="allOf.driver.dbi, device=MCXN537.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dbi, device=MCXN537.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require condition="device.MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.st7796s.condition_id">
      <require condition="allOf.driver.dbi, device=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.syspm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN537.internal_condition"/>
    </condition>
    <condition id="driver.tdet.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN537.internal_condition"/>
    </condition>
