vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN537_DFP.pdsc
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_examples_mac_modes" Cversion="1.9.0" condition="component.els_pkc.examples_mac_modes.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClMacModes/mcuxClMacModes_Els_Cbcmac_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClMacModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClMacModes/mcuxClMacModes_Els_Cbcmac_Aes256_Multipart_PaddingZero_example.c" projectpath="component/els_pkc/examples/mcuxClMacModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClMacModes/mcuxClMacModes_Els_Cmac_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClMacModes"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_examples_memory" Cversion="1.9.0" condition="component.els_pkc.examples_memory.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxCsslMemory/mcuxCsslMemory_Clear_example.c" projectpath="component/els_pkc/examples/mcuxCsslMemory"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxCsslMemory/mcuxCsslMemory_Compare_example.c" projectpath="component/els_pkc/examples/mcuxCsslMemory"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxCsslMemory/mcuxCsslMemory_Copy_example.c" projectpath="component/els_pkc/examples/mcuxCsslMemory"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxCsslMemory/mcuxCsslMemory_Set_example.c" projectpath="component/els_pkc/examples/mcuxCsslMemory"/>
        <file category="header" name="components/els_pkc/examples/mcuxCsslMemory/inc/mcuxCsslMemory_Examples.h" projectpath="component/els_pkc/examples/mcuxCsslMemory/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_examples_random_modes" Cversion="1.9.0" condition="component.els_pkc.examples_random_modes.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_CtrDrbg_AES256_DRG3_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_CtrDrbg_AES256_DRG4_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_CtrDrbg_AES256_ELS_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_Different_Sessions_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_PatchMode_CtrDrbg_AES256_DRG3_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_TestMode_CtrDrbg_AES256_DRG4_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_examples_rsa" Cversion="1.9.0" condition="component.els_pkc.examples_rsa.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRsa/mcuxClRsa_sign_NoEncode_example.c" projectpath="component/els_pkc/examples/mcuxClRsa"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRsa/mcuxClRsa_sign_pss_sha2_256_example.c" projectpath="component/els_pkc/examples/mcuxClRsa"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRsa/mcuxClRsa_verify_NoVerify_example.c" projectpath="component/els_pkc/examples/mcuxClRsa"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRsa/mcuxClRsa_verify_pssverify_sha2_256_example.c" projectpath="component/els_pkc/examples/mcuxClRsa"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_flow_protection" Cversion="1.9.0" condition="component.els_pkc.flow_protection.condition_id">
      <description>Component els_pkc.flow_protection</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_Cfg.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_FunctionIdentifiers.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_Impl.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_SecureCounter_Common.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_SecureCounter_Local.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_glikey" Cversion="1.9.0" condition="component.els_pkc.glikey.condition_id">
      <description>Component glikey</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClGlikey/src/mcuxClGlikey.c" projectpath="component/els_pkc/src/comps/mcuxClGlikey/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClGlikey/inc/mcuxClGlikey.h" projectpath="component/els_pkc/src/comps/mcuxClGlikey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClGlikey/inc/internal/mcuxClGlikey_SfrAccess.h" projectpath="component/els_pkc/src/comps/mcuxClGlikey/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClGlikey/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClGlikey/inc/internal/"/>
      </files>
    </component>
