vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN537_DFP.pdsc
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_oscca_sm3" Cversion="1.9.0" condition="component.els_pkc.oscca_sm3.condition_id">
      <description>Component els_pkc.oscca_sm3</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm3/src/mcuxClOsccaSm3_core_sm3.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm3/src/mcuxClOsccaSm3_internal_sm3.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/mcuxClOsccaSm3.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/mcuxClOsccaSm3_Algorithms.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/mcuxClOsccaSm3_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal/mcuxClOsccaSm3_Core_sm3.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal/mcuxClOsccaSm3_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal/mcuxClOsccaSm3_Internal_sm3.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_oscca_sm4" Cversion="1.9.0" condition="component.els_pkc.oscca_sm4.condition_id">
      <description>Component els_pkc.oscca_sm4</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm4/src/mcuxClOsccaSm4_CommonOperations.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm4/src/mcuxClOsccaSm4_Core.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm4/src/mcuxClOsccaSm4_KeyTypes.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm4/src/mcuxClOsccaSm4_LoadKey.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/mcuxClOsccaSm4.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/mcuxClOsccaSm4_KeyTypes.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal/mcuxClOsccaSm4_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal/mcuxClOsccaSm4_Internal_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal/mcuxClOsccaSm4_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_padding" Cversion="1.9.0" condition="component.els_pkc.padding.condition_id">
      <description>Component els_pkc.padding</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPadding/src/mcuxClPadding.c" projectpath="component/els_pkc/src/comps/mcuxClPadding/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/mcuxClPadding.h" projectpath="component/els_pkc/src/comps/mcuxClPadding/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/mcuxClPadding_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClPadding/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/mcuxClPadding_Types.h" projectpath="component/els_pkc/src/comps/mcuxClPadding/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/internal/mcuxClPadding_Functions_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClPadding/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/internal/mcuxClPadding_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClPadding/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/internal/mcuxClPadding_Types_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClPadding/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPadding/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPadding/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_param_integrity" Cversion="1.9.0" condition="component.els_pkc.param_integrity.condition_id">
      <description>Component els_pkc.param_integrity</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxCsslParamIntegrity/src/mcuxCsslParamIntegrity32.c" projectpath="component/els_pkc/src/comps/mcuxCsslParamIntegrity/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslParamIntegrity/inc/mcuxCsslParamIntegrity.h" projectpath="component/els_pkc/src/comps/mcuxCsslParamIntegrity/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxCsslParamIntegrity/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_pkc" Cversion="1.9.0" condition="component.els_pkc.pkc.condition_id">
      <description>Component pkc</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_Calculate.c" projectpath="component/els_pkc/src/comps/mcuxClPkc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_ImportExport.c" projectpath="component/els_pkc/src/comps/mcuxClPkc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_Initialize.c" projectpath="component/els_pkc/src/comps/mcuxClPkc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_UPTRT.c" projectpath="component/els_pkc/src/comps/mcuxClPkc/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/mcuxClPkc.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/mcuxClPkc_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/mcuxClPkc_Types.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_FupMacros.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_ImportExport.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Inline_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Macros.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Operations.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Resource.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_SfrAccess.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPkc/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_platform" Cversion="1.9.0" condition="component.els_pkc.platform.mcxn.condition_id">
      <description>Component els_pkc_mcxn</description>
      <files>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/platform_specific_headers.h" projectpath="component/els_pkc/src/platforms/mcxn"/>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/mcuxClConfig.h" projectpath="component/els_pkc/src/platforms/mcxn"/>
        <file category="sourceC" name="components/els_pkc/src/platforms/mcxn/mcux_els.c" projectpath="component/els_pkc/src/platforms/mcxn"/>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/mcux_els.h" projectpath="component/els_pkc/src/platforms/mcxn"/>
        <file category="sourceC" name="components/els_pkc/src/platforms/mcxn/mcux_pkc.c" projectpath="component/els_pkc/src/platforms/mcxn"/>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/mcux_pkc.h" projectpath="component/els_pkc/src/platforms/mcxn"/>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/inc/ip_css_constants.h" projectpath="component/els_pkc/src/platforms/mcxn/inc"/>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/inc/ip_css_design_configuration.h" projectpath="component/els_pkc/src/platforms/mcxn/inc"/>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/inc/ip_platform.h" projectpath="component/els_pkc/src/platforms/mcxn/inc"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClAeadModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClCipherModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClEcc_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClHashModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClHash_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClHmac_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClKey_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClMacModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClOsccaSm3_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClRandomModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClRsa_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClSession_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/platforms/mcxn/"/>
        <file category="include" name="components/els_pkc/src/platforms/mcxn/inc/"/>
        <file category="include" name="components/els_pkc/includes/platform/mcxn/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_pre_processor" Cversion="1.9.0" condition="component.els_pkc.pre_processor.condition_id">
      <description>Component els_pkc.pre_processor</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/mcuxCsslAnalysis.h" projectpath="component/els_pkc/src/comps/mcuxCsslCPreProcessor/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/mcuxCsslCPreProcessor.h" projectpath="component/els_pkc/src/comps/mcuxCsslCPreProcessor/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_prng" Cversion="1.9.0" condition="component.els_pkc.prng.condition_id">
      <description>Component prng</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPrng/src/mcuxClPrng_ELS.c" projectpath="component/els_pkc/src/comps/mcuxClPrng/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_ELS.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPrng/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_psa_driver" Cversion="1.9.0" condition="component.els_pkc.psa_driver.condition_id">
      <description>Component els_pkc_psa_driver</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Aead.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Cipher.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_DER_functions.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_export_public_key.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_generate_ecp_key.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Hash.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Key.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Mac.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Rsa.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Sign.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_UpdateKeyStatus.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Verify.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver_MemoryConsumption.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver_Oracle.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/els_pkc_crypto_primitives.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/els_pkc_crypto_composites.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_ExternalMacroWrappers.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_Types.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN537 els_pkc" Cgroup="els_pkc_random" Cversion="1.9.0" condition="component.els_pkc.random.condition_id">
      <description>Component els_pkc.random</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandom/src/mcuxClRandom_DRBG.c" projectpath="component/els_pkc/src/comps/mcuxClRandom/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandom/src/mcuxClRandom_PRNG.c" projectpath="component/els_pkc/src/comps/mcuxClRandom/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Types.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/mcuxClRandom_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/mcuxClRandom_Internal_Memory.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/mcuxClRandom_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandom/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/"/>
      </files>
    </component>
