vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN537_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-lan8741" Cversion="2.0.0" condition="component.phylan8741.condition_id">
      <description>Driver phy-device-lan8741</description>
      <files>
        <file category="sourceC" name="components/phy/device/phylan8741/fsl_phylan8741.c" projectpath="phy"/>
        <file category="header" name="components/phy/device/phylan8741/fsl_phylan8741.h" projectpath="phy"/>
        <file category="include" name="components/phy/device/phylan8741/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-rtl8201" Cversion="2.0.0" condition="component.phyrtl8201.condition_id">
      <description>Driver phy-device-rtl8201</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyrtl8201/fsl_phyrtl8201.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyrtl8201/fsl_phyrtl8201.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyrtl8201/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-rtl8211f" Cversion="2.0.0" condition="component.phyrtl8211f.condition_id">
      <description>Driver phy-device-rtl8211f</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyrtl8211f/fsl_phyrtl8211f.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyrtl8211f/fsl_phyrtl8211f.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyrtl8211f/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-tja1100" Cversion="2.0.0" condition="component.phytja1100.condition_id">
      <description>Driver phy-device-tja1100</description>
      <files>
        <file category="sourceC" name="components/phy/device/phytja1100/fsl_phytja1100.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phytja1100/fsl_phytja1100.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phytja1100/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-tja1120" Cversion="2.0.0" condition="component.phytja1120.condition_id">
      <description>Driver phy-device-tja1120</description>
      <files>
        <file category="sourceC" name="components/phy/device/phytja1120/fsl_phytja1120.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phytja1120/fsl_phytja1120.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phytja1120/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-vsc8541" Cversion="2.0.0" condition="component.phyvsc8541.condition_id">
      <description>Driver phy-device-vsc8541</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyvsc8541/fsl_phyvsc8541.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyvsc8541/fsl_phyvsc8541.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyvsc8541/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-yt8521" Cversion="2.0.0" condition="component.phyyt8521.condition_id">
      <description>Driver phy-device-yt8521</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyyt8521/fsl_phyyt8521.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyyt8521/fsl_phyyt8521.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyyt8521/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="power_manager_core" Cversion="2.0.0" condition="component.power_manager_framework.condition_id">
      <description>Component power manager core level</description>
      <RTE_Components_h>
#ifndef GENERIC_LIST_LIGHT
#define GENERIC_LIST_LIGHT 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/power_manager/core/fsl_pm_core.h" projectpath="component/power_manager"/>
        <file category="sourceC" name="components/power_manager/core/fsl_pm_core.c" projectpath="component/power_manager"/>
        <file category="header" name="components/power_manager/core/fsl_pm_config.h" projectpath="component/power_manager"/>
        <file category="sourceC" name="components/power_manager/devices/MCXN94x/fsl_pm_device.c" projectpath="component/devices/MCXN94x"/>
        <file category="header" name="components/power_manager/devices/MCXN94x/fsl_pm_device.h" projectpath="component/devices/MCXN94x"/>
        <file category="header" name="components/power_manager/devices/MCXN94x/fsl_pm_device_config.h" projectpath="component/devices/MCXN94x"/>
        <file category="include" name="components/power_manager/core/"/>
        <file category="include" name="components/power_manager/devices/MCXN94x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm_ctimer_adapter" Cversion="1.0.0" condition="component.pwm_ctimer_adapter.condition_id">
      <description>Component pwm_ctimer_adapter</description>
      <files>
        <file category="header" name="components/pwm/fsl_adapter_pwm.h" projectpath="component/pwm"/>
        <file category="sourceC" name="components/pwm/fsl_adapter_pwm_ctimer.c" projectpath="component/pwm"/>
        <file category="include" name="components/pwm/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset_adapter" Cversion="1.0.0" condition="component.reset_adapter.condition_id">
      <description>Component reset_adapter</description>
      <files>
        <file category="header" name="components/reset/fsl_adapter_reset.h" projectpath="component/reset"/>
        <file category="sourceC" name="components/reset/fsl_adapter_reset.c" projectpath="component/reset"/>
        <file category="include" name="components/reset/"/>
      </files>
    </component>
